app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @sort_by = session[:sort_by]
    @ratings = session[:ratings]
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "title"]]

  def index
    @sort_by = session[:sort_by]
    @ratings = params[:ratings] || Hash[@all_ratings.zip(@all_ratings.map{|m| 1})]
    session[:ratings] =@ratings
    if(params[:ratings] == nil)
	redirect_to movies_path(sort_by: @sort_by, ratings: @ratings)
    else
     @ratings = params[:ratings]
    end

    if @sort_by == nil
	@movies = Movie.where(rating: @ratings.keys).all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') ORDER BY release_date

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "movies" SET "title" = 'test movie', "updated_at" = '2013-08-02 08:49:39.870477' WHERE "movies"."id" = 16